{
  "ro": {
    "settings_btn": "Setări",
    "grids_btn": "Grile",
    "colors_btn": "Culori",
    "recorder_btn": "Recorder",
    "grid_size_title": "Selectează mărimea grilei",
    "obstacles_title": "Alege generarea obstacolelor",
    "maze_button": "Generează labirint",
    "obstacles_button": "Generează obstacole",
    "clear_button": "Curăță grila",
    "spots_title": "Alege forma grilei",
    "spots_square": "Pătrat",
    "spots_triangle": "Triunghi",
    "spots_hexagon": "Hexagon",
    "arrow_coords_title": "Selectează opțiuni adiționale",
    "show_arrows": "Arată predecesori",
    "show_coords": "Arată coordonate",
    "delay_title": "Întârzierea executării",
    "drop_down_title": "Alege un algoritm",
    "heuristic_title": "Alege o euristică",
    "diagonal_title": "Opțiuni de executare",
    "diagonal_option": "Permite diagonal",
    "run_algorithm": "Rulează algoritmul",
    "nodes_label": "Noduri extinse: ",
    "steps_label": "Pași: ",
    "length_label": "Lungimea căii: ",
    "time_label": "Timp luat: ",
    "bfs_text": " <font face=fira_code size=2.5> <img src=\"images/bfs.jpg\" float=left padding=\"5px 10px 5px 50px\"> <b> Breadth-First Search (BFS)</b> este un algoritm pentru căutarea unui nod într-o structură de date de tip arbore care satisface o proprietate dată. Acesta începe de la rădăcina arborelui și explorează toate nodurile de la adâncimea actuală înainte de a trece la nodurile de la nivelul următor de adâncime. </font>",
    "dfs_text": "<font face=fira_code size=2.5> <img src=\"images/dfs.jpg\" float=left padding=\"5px 10px 5px 50px\">  <b> Depth-First Search (DFS)</b> este un algoritm pentru parcurgerea sau căutarea în structuri de date de tip arbore sau graf. Algoritmul începe de la nodul rădăcină (selectând un nod arbitrar ca nod rădăcină în cazul unui graf) și explorează cât mai mult posibil pe fiecare ramură înainte de a reveni. </font>",
    "dijkstra_text": "<font face=fira_code size=2.5> <img src=\"images/dijkstra.jpg\" float=left padding=\"5px 10px 5px 50px\">  <b> Algoritmul lui Dijkstra</b> este ideal pentru a găsi cea mai scurtă cale între a și b. Acesta alege vârful nevizitat cu cea mai mică distanță, calculează distanța prin acesta până la fiecare vecin nevizitat și actualizează distanța vecinului dacă este mai mică.</font>",
    "astar_text": "<font face=fira_code size=2.5> <img src=\"images/astar.jpg\" float=left padding=\"5px 40px 5px 50px\">  <b> A* (A-star)</b> este cel mai popular algoritm de căutare pentru determinarea traseelor, deoarece este destul de flexibil și poate fi utilizat într-o gamă largă de contexte. Acesta începe de la nodul de start și explorează nodurile vecine bazându-se pe o combinație între costul de a ajunge la ele și un cost estimat (euristic) pentru a ajunge la țintă de la ele. Aceasta îi permite să prioritizeze nodurile care sunt mai probabil să conducă la o soluție optimă, făcându-l mai eficient decât explorarea tuturor nodurilor de la același nivel de adâncime, așa cum se întâmplă în căutarea în lățime. </font> ",
    "greedy_text": "<font face=fira_code size=2.5> <img src=\"images/best.jpg\" float=left padding=\"5px 10px 0px 50px\">  <b> Greedy Best-First-Search</b> este un algoritm de căutare care, spre deosebire de A* sau căutarea în lățime, selectează nodul de explorat în continuare doar pe baza unei euristici care estimează costul de la un nod la țintă, fără a lua în considerare costul de a ajunge la acel nod de la început. Ca atare, este considerat 'lacom' deoarece face alegerea optimă locală la fiecare pas cu speranța că aceste decizii locale vor conduce la o soluție global optimă. Cu toate acestea, această abordare poate uneori duce la soluții mai puțin optimale sau chiar poate eșua în găsirea unei soluții, dacă euristica nu este bine aleasă sau dacă există obstacole în cale. </font>",
    "grids_window": "Modul de comparare",
    "grids_title": "Alege numărul de grile",
    "algorithm_error_label": "Plasează punctele căii!",
    "grid_nr_error": "Prea mulți algoritmi aleși!",
    "generate_grids": "Generează grile",
    "results_window": "Rezultatele comparării"
  }
}